{"config": [{"config": {"filters": 32, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "dtype": "float32", "dilation_rate": [1, 1], "padding": "same", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "bias_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "padding": "same", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "filters": 64, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [1, 1], "bias_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "padding": "same", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "filters": 64, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "bias_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1], "padding": "same", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "filters": 128, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [1, 1], "bias_regularizer": null, "name": "conv2d_5", "dilation_rate": [1, 1], "padding": "same", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "filters": 128, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "bias_regularizer": null, "name": "conv2d_6", "dilation_rate": [1, 1], "padding": "same", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "filters": 256, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [1, 1], "bias_regularizer": null, "name": "conv2d_7", "dilation_rate": [1, 1], "padding": "same", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "filters": 256, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "units": 128, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "units": 128, "name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_6", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "units": 7, "name": "dense_3", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_10", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}